#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-sso-requests/runs/run-RbCqZnmUW3pfkBTd

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=AMzs6g]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=gcp9dahm4c]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210630175300092700000001]
aws_api_gateway_resource.proxy: Refreshing state... [id=oly2td]
aws_api_gateway_method.proxy_root: Refreshing state... [id=agm-gcp9dahm4c-irntllxe14-ANY]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-gcp9dahm4c-oly2td-ANY]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-064f9794b304dc7dd]
aws_security_group.rds_sg: Refreshing state... [id=sg-0dd30e1d7b3040e06]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-4119090639]
aws_lambda_function.auth: Refreshing state... [id=handler]
aws_lambda_permission.apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-gcp9dahm4c-oly2td-ANY]
aws_api_gateway_integration.lambda_root: Refreshing state... [id=agi-gcp9dahm4c-irntllxe14-ANY]
aws_api_gateway_deployment.this: Refreshing state... [id=nn1sip]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.db.aws_security_group_rule.default_ingress[0] has been changed
  ~ resource "aws_security_group_rule" "default_ingress" {
      + cidr_blocks              = []
        id                       = "sgrule-4119090639"
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
        # (8 unchanged attributes hidden)
    }
  # module.db.aws_rds_cluster.this[0] has been changed
  ~ resource "aws_rds_cluster" "this" {
      + enabled_cloudwatch_logs_exports     = []
      + iam_roles                           = []
        id                                  = "aurora-db-postgres"
        tags                                = {
            "Terraform" = "true"
        }
        # (36 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.db.aws_security_group.this[0] has been changed
  ~ resource "aws_security_group" "this" {
        id                     = "sg-064f9794b304dc7dd"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "From allowed SGs"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0dd30e1d7b3040e06",
                ]
              + self             = false
              + to_port          = 5432
            },
        ]
        name                   = "aurora-db-postgres-20210630183109998100000001"
        tags                   = {
            "Name"      = "aurora-aurora-db-postgres"
            "Terraform" = "true"
        }
        # (8 unchanged attributes hidden)
    }
  # aws_lambda_function.auth has been changed
  ~ resource "aws_lambda_function" "auth" {
        id                             = "handler"
      ~ last_modified                  = "2021-06-30T20:11:27.889+0000" -> "2021-06-30T20:13:39.134+0000"
      + layers                         = []
      + tags                           = {}
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # aws_api_gateway_integration.lambda has been changed
  ~ resource "aws_api_gateway_integration" "lambda" {
      + cache_key_parameters    = []
        id                      = "agi-gcp9dahm4c-oly2td-ANY"
      + request_parameters      = {}
      + request_templates       = {}
        # (10 unchanged attributes hidden)
    }
  # aws_api_gateway_integration.lambda_root has been changed
  ~ resource "aws_api_gateway_integration" "lambda_root" {
      + cache_key_parameters    = []
        id                      = "agi-gcp9dahm4c-irntllxe14-ANY"
      + request_parameters      = {}
      + request_templates       = {}
        # (10 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      + function_name = "lambda-db"
      + id            = (known after apply)
      + input         = jsonencode({})
      + result        = (known after apply)
    }

  # aws_lambda_function.auth will be updated in-place
  ~ resource "aws_lambda_function" "auth" {
        id                             = "handler"
      ~ last_modified                  = "2021-06-30T20:13:39.134+0000" -> (known after apply)
      ~ source_code_hash               = "t1KbfQAMNRGokXr7gsVWnXaMspo+GsfF6OEDRPFwnPs=" -> "NtF8IIu86EDl1FArLjMeo+5d/TPfZavwjtPAK1jSrjI="
        tags                           = {}
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DB_HOSTNAME"            = "aurora-db-postgres.cluster-ch8pcggluehm.ca-central-1.rds.amazonaws.com"
              + "NODE_ENV"               = "production"
              - "RDS_ENDPOINT"           = "aurora-db-postgres.cluster-ch8pcggluehm.ca-central-1.rds.amazonaws.com" -> null
                # (5 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be created
  + resource "aws_lambda_function" "db" {
      + arn                            = (known after apply)
      + filename                       = "lambda-db.zip"
      + function_name                  = "lambda-db"
      + handler                        = "db/src/main.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::220881534007:role/iam_for_lambda"
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "objUJ6ss7hQQGHI96a1/7X3azMPFycYOlEpGO+1mhEU="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DB_HOSTNAME" = "aurora-db-postgres.cluster-ch8pcggluehm.ca-central-1.rds.amazonaws.com"
              + "DB_NAME"     = "ExampleDB"
              + "DB_PASSWORD" = (sensitive)
              + "DB_USERNAME" = (sensitive)
              + "NODE_ENV"    = "production"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0dd30e1d7b3040e06",
            ]
          + subnet_ids         = [
              + "subnet-0077fd92d83bfff33",
              + "subnet-089c577af80110363",
            ]
          + vpc_id             = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + result_entry = (known after apply)

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 1 of 2 estimated
           $89.28/mo +$0.0
```

</details>

*Pusher: @junminahn, Action: `pull_request`*